aws/amazon-freertos/vendors/renesas/rx_driver_package/v125/r_bsp/mcu/rx24t/register_access/iccrx/iodefine.h
/* IAR file generator: v1.0 */

/*********************************************************************************
*
* Device     : RX/RX200/RX24T
*
* File Name  : iodefine.h
*
* Abstract   : Definition of I/O Register.
*
* History    : 0.5  (2015-06-15)  [Hardware Manual Revision : 0.50]
*            : 1.0  (2015-10-26)  [Hardware Manual Revision : 1.00]
*            : 1.0A (2016-02-26)  [Hardware Manual Revision : 1.00]
*            : 1.0B (2016-08-03)  [Hardware Manual Revision : 1.00]
*            : 1.0C (2016-11-24)  [Hardware Manual Revision : 1.10]
*            : 1.0D (2016-12-06)  [Hardware Manual Revision : 1.10]
*            : 1.0E (2017-01-06)  [Hardware Manual Revision : 1.10]
*            : 1.0F (2017-01-25)  [Hardware Manual Revision : 1.10]
*            : 1.0G (2017-01-26)  [Hardware Manual Revision : 1.10]
*            : 1.0H (2017-01-26)  [Hardware Manual Revision : 1.10]
*
* NOTE       : THIS IS A TYPICAL EXAMPLE.
*
* Copyright (C) 2016 (2015) Renesas Electronics Corporation.
*
*********************************************************************************/
/********************************************************************************/
/*                                                                              */
/*  DESCRIPTION : Definition of ICU Register                                    */
/*  CPU TYPE    : RX24T                                                         */
/*                                                                              */
/*  Usage : IR,DTCER,IER,IPR of ICU Register                                    */
/*     The following IR, DTCE, IEN, IPR macro functions simplify usage.         */
/*     The bit access operation is "Bit_Name(interrupt source,name)".           */
/*     A part of the name can be omitted.                                       */
/*     for example :                                                            */
/*       IR(MTU0,TGIA0) = 0;     expands to :                                   */
/*         ICU.IR[114].BIT.IR = 0;                                              */
/*                                                                              */
/*       DTCE(ICU,IRQ0) = 1;     expands to :                                   */
/*         ICU.DTCER[64].BIT.DTCE = 1;                                          */
/*                                                                              */
/*       IEN(CMT0,CMI0) = 1;     expands to :                                   */
/*         ICU.IER[0x03].BIT.IEN4 = 1;                                          */
/*                                                                              */
/*       IPR(MTU1,TGIA1) = 2;    expands to :                                   */
/*       IPR(MTU1,TGI  ) = 2;    // TGIA1,TGIB1 share IPR level.                */
/*         ICU.IPR[121].BIT.IPR = 2;                                            */
/*                                                                              */
/*       IPR(SCI1,ERI1) = 3;     expands to :                                   */
/*       IPR(SCI1,    ) = 3;     // SCI1 uses single IPR for all sources.       */
/*         ICU.IPR[218].BIT.IPR = 3;                                            */
/*                                                                              */
/*  Usage : #pragma interrupt Function_Identifier(vect=**)                      */
/*     The number of vector is "(interrupt source, name)".                      */
/*     for example :                                                            */
/*       #pragma interrupt INT_IRQ0(vect=VECT(ICU,IRQ0))          expands to :  */
/*         #pragma interrupt INT_IRQ0(vect=64)                                  */
/*       #pragma interrupt INT_CMT0_CMI0(vect=VECT(CMT0,CMI0))    expands to :  */
/*         #pragma interrupt INT_CMT0_CMI0(vect=28)                             */
/*       #pragma interrupt INT_MTU0_TGIA0(vect=VECT(MTU0,TGIA0))  expands to :  */
/*         #pragma interrupt INT_MTU0_TGIA0(vect=114)                           */
/*                                                                              */
/*  Usage : MSTPCRA,MSTPCRB,MSTPCRC of SYSTEM Register                          */
/*     The bit access operation is "MSTP(name)".                                */
/*     The name that can be used is a macro name defined with "iodefine.h".     */
/*     for example :                                                            */
/*       MSTP(TMR2) = 0;    // TMR2,TMR3,TMR23                    expands to :  */
/*         SYSTEM.MSTPCRA.BIT.MSTPA4  = 0;                                      */
/*       MSTP(MTU4) = 0;    // MTU,MTU0,MTU1,MTU2,MTU3,MTU4,...   expands to :  */
/*         SYSTEM.MSTPCRA.BIT.MSTPA9  = 0;                                      */
/*       MSTP(CMT3) = 0;    // CMT2,CMT3                          expands to :  */
/*         SYSTEM.MSTPCRA.BIT.MSTPA14 = 0;                                      */
/*                                                                              */
/*                                                                              */
/********************************************************************************/
#ifndef __RX24TIODEFINE_HEADER__
#define __RX24TIODEFINE_HEADER__

#ifdef __IAR_SYSTEMS_ICC__
#pragma language=save
#pragma language=extended
#ifndef _SYSTEM_BUILD
#pragma system_include
#endif
#endif

#ifdef __IAR_SYSTEMS_ICC__
#define __evenaccess
#else
#define __sfr
#endif



#define	IEN_BSC_BUSERR		IEN0
#define	IEN_FCU_FRDYI		IEN7
#define	IEN_ICU_SWINT		IEN3
#define	IEN_CMT0_CMI0		IEN4
#define	IEN_CMT1_CMI1		IEN5
#define	IEN_CMT2_CMI2		IEN6
#define	IEN_CMT3_CMI3		IEN7
#define	IEN_CAC_FERRF		IEN0
#define	IEN_CAC_MENDF		IEN1
#define	IEN_CAC_OVFF		IEN2
#define IEN_GPT_ETGIN           IEN0
#define IEN_GPT_ETGIP           IEN1
#define	IEN_RSPI0_SPEI0		IEN4
#define	IEN_RSPI0_SPRI0		IEN5
#define	IEN_RSPI0_SPTI0		IEN6
#define	IEN_RSPI0_SPII0		IEN7
#define IEN_GPT0_GTCIA0         IEN0
#define IEN_GPT0_GTCIB0         IEN1
#define IEN_GPT0_GTCIC0         IEN2
#define IEN_GPT0_GTCID0         IEN3
#define IEN_GPT0_GDTE0          IEN4
#define IEN_GPT0_GTCIE0         IEN5
#define IEN_GPT0_GTCIF0         IEN6
#define IEN_GPT0_GTCIV0         IEN7
#define IEN_GPT0_GTCIU0         IEN0
#define	IEN_DOC_DOPCF		IEN1
#define	IEN_RSCAN_COMFRXINT	IEN3
#define	IEN_RSCAN_RXFINT	IEN4
#define	IEN_RSCAN_TXINT		IEN5
#define	IEN_RSCAN_CHERRINT	IEN6
#define	IEN_RSCAN_GLERRINT	IEN7
#define	IEN_ICU_IRQ0		IEN0
#define	IEN_ICU_IRQ1		IEN1
#define	IEN_ICU_IRQ2		IEN2
#define	IEN_ICU_IRQ3		IEN3
#define	IEN_ICU_IRQ4		IEN4
#define	IEN_ICU_IRQ5		IEN5
#define	IEN_ICU_IRQ6		IEN6
#define	IEN_ICU_IRQ7		IEN7
#define	IEN_LVD_LVD1		IEN0
#define	IEN_LVD_LVD2		IEN1
#define IEN_GPT1_GTCIA1         IEN2
#define IEN_GPT1_GTCIB1         IEN3
#define IEN_GPT1_GTCIC1         IEN4
#define IEN_GPT1_GTCID1         IEN5
#define	IEN_S12AD_S12ADI	IEN6
#define	IEN_S12AD_GBADI		IEN7
#define	IEN_S12AD_GCADI		IEN0
#define	IEN_S12AD1_S12ADI1	IEN1
#define	IEN_S12AD1_GBADI1	IEN2
#define	IEN_S12AD1_GCADI1	IEN3
#define	IEN_CMPC0_CMPC0		IEN4
#define	IEN_CMPC1_CMPC1		IEN5
#define	IEN_CMPC2_CMPC2		IEN6
#define	IEN_S12AD2_S12ADI2	IEN7
#define	IEN_S12AD2_GBADI2	IEN0
#define	IEN_S12AD2_GCADI2	IEN1
#define	IEN_MTU0_TGIA0		IEN2
#define	IEN_MTU0_TGIB0		IEN3
#define	IEN_MTU0_TGIC0		IEN4
#define	IEN_MTU0_TGID0		IEN5
#define	IEN_MTU0_TCIV0		IEN6
#define	IEN_MTU0_TGIE0		IEN7
#define	IEN_MTU0_TGIF0		IEN0
#define	IEN_MTU1_TGIA1		IEN1
#define	IEN_MTU1_TGIB1		IEN2
#define	IEN_MTU1_TCIV1		IEN3
#define	IEN_MTU1_TCIU1		IEN4
#define	IEN_MTU2_TGIA2		IEN5
#define	IEN_MTU2_TGIB2		IEN6
#define	IEN_MTU2_TCIV2		IEN7
#define	IEN_MTU2_TCIU2		IEN0
#define	IEN_MTU3_TGIA3		IEN1
#define	IEN_MTU3_TGIB3		IEN2
#define	IEN_MTU3_TGIC3		IEN3
#define	IEN_MTU3_TGID3		IEN4
#define	IEN_MTU3_TCIV3		IEN5
#define	IEN_MTU4_TGIA4		IEN6
#define	IEN_MTU4_TGIB4		IEN7
#define	IEN_MTU4_TGIC4		IEN0
#define	IEN_MTU4_TGID4		IEN1
#define	IEN_MTU4_TCIV4		IEN2
#define	IEN_MTU5_TGIU5		IEN3
#define	IEN_MTU5_TGIV5		IEN4
#define	IEN_MTU5_TGIW5		IEN5
#define	IEN_MTU6_TGIA6		IEN6
#define	IEN_MTU6_TGIB6		IEN7
#define	IEN_MTU6_TGIC6		IEN0
#define	IEN_MTU6_TGID6		IEN1
#define	IEN_MTU6_TCIV6		IEN2
#define	IEN_MTU7_TGIA7		IEN5
#define	IEN_MTU7_TGIB7		IEN6
#define	IEN_MTU7_TGIC7		IEN7
#define	IEN_MTU7_TGID7		IEN0
#define	IEN_MTU7_TCIV7		IEN1
#define	IEN_MTU9_TGIA9		IEN7
#define	IEN_MTU9_TGIB9		IEN0
#define	IEN_MTU9_TGIC9		IEN1
#define	IEN_MTU9_TGID9		IEN2
#define	IEN_MTU9_TCIV9		IEN3
#define	IEN_MTU9_TGIE9		IEN4
#define	IEN_MTU9_TGIF9		IEN5
#define	IEN_POE_OEI1		IEN0
#define	IEN_POE_OEI2		IEN1
#define	IEN_POE_OEI3		IEN2
#define	IEN_POE_OEI4		IEN3
#define	IEN_POE_OEI5		IEN4
#define	IEN_CMPC3_CMPC3		IEN5
#define	IEN_TMR0_CMIA0		IEN6
#define	IEN_TMR0_CMIB0		IEN7
#define	IEN_TMR0_OVI0		IEN0
#define	IEN_TMR1_CMIA1		IEN1
#define	IEN_TMR1_CMIB1		IEN2
#define	IEN_TMR1_OVI1		IEN3
#define	IEN_TMR2_CMIA2		IEN4
#define	IEN_TMR2_CMIB2		IEN5
#define	IEN_TMR2_OVI2		IEN6
#define	IEN_TMR3_CMIA3		IEN7
#define	IEN_TMR3_CMIB3		IEN0
#define	IEN_TMR3_OVI3		IEN1
#define	IEN_TMR4_CMIA4		IEN2
#define	IEN_TMR4_CMIB4		IEN3
#define	IEN_TMR4_OVI4		IEN4
#define	IEN_TMR5_CMIA5		IEN5
#define	IEN_TMR5_CMIB5		IEN6
#define	IEN_TMR5_OVI5		IEN7
#define	IEN_TMR6_CMIA6		IEN0
#define	IEN_TMR6_CMIB6		IEN1
#define	IEN_TMR6_OVI6		IEN2
#define	IEN_TMR7_CMIA7		IEN3
#define	IEN_TMR7_CMIB7		IEN4
#define	IEN_TMR7_OVI7		IEN5
#define IEN_GPT1_GDTE1          IEN2
#define IEN_GPT1_GTCIE1         IEN3
#define IEN_GPT1_GTCIF1         IEN4
#define IEN_GPT1_GTCIV1         IEN5
#define IEN_GPT1_GTCIU1         IEN6
#define IEN_GPT2_GTCIA2         IEN7
#define IEN_GPT2_GTCIB2         IEN0
#define IEN_GPT2_GTCIC2         IEN1
#define IEN_GPT2_GTCID2         IEN2
#define IEN_GPT2_GDTE2          IEN3
#define IEN_GPT2_GTCIE2         IEN4
#define IEN_GPT2_GTCIF2         IEN5
#define IEN_GPT2_GTCIV2         IEN6
#define IEN_GPT2_GTCIU2         IEN7
#define IEN_GPT3_GTCIA3         IEN0
#define IEN_GPT3_GTCIB3         IEN1
#define	IEN_SCI1_ERI1		IEN2
#define	IEN_SCI1_RXI1		IEN3
#define	IEN_SCI1_TXI1		IEN4
#define	IEN_SCI1_TEI1		IEN5
#define	IEN_SCI5_ERI5		IEN6
#define	IEN_SCI5_RXI5		IEN7
#define	IEN_SCI5_TXI5		IEN0
#define	IEN_SCI5_TEI5		IEN1
#define	IEN_SCI6_ERI6		IEN2
#define	IEN_SCI6_RXI6		IEN3
#define	IEN_SCI6_TXI6		IEN4
#define	IEN_SCI6_TEI6		IEN5
#define IEN_SCI8_ERI8           IEN6
#define IEN_SCI8_RXI8           IEN7
#define IEN_SCI8_TXI8           IEN0
#define IEN_SCI8_TEI8           IEN1
#define IEN_SCI9_ERI9           IEN2
#define IEN_SCI9_RXI9           IEN3
#define IEN_SCI9_TXI9           IEN4
#define IEN_SCI9_TEI9           IEN5
#define IEN_GPT3_GTCIC3         IEN6
#define IEN_GPT3_GTCID3         IEN7
#define IEN_GPT3_GDTE3          IEN0
#define IEN_GPT3_GTCIE3         IEN1
#define IEN_GPT3_GTCIF3         IEN2
#define IEN_GPT3_GTCIV3         IEN3
#define IEN_GPT3_GTCIU3         IEN4
#define	IEN_RIIC0_EEI0		IEN6
#define	IEN_RIIC0_RXI0		IEN7
#define	IEN_RIIC0_TXI0		IEN0
#define	IEN_RIIC0_TEI0		IEN1
#define IEN_SCI11_ERI11         IEN2
#define IEN_SCI11_RXI11         IEN3
#define IEN_SCI11_TXI11         IEN4
#define IEN_SCI11_TEI11         IEN5

#define	VECT_BSC_BUSERR		16
#define	VECT_FCU_FRDYI		23
#define	VECT_ICU_SWINT		27
#define	VECT_CMT0_CMI0		28
#define	VECT_CMT1_CMI1		29
#define	VECT_CMT2_CMI2		30
#define	VECT_CMT3_CMI3		31
#define	VECT_CAC_FERRF		32
#define	VECT_CAC_MENDF		33
#define	VECT_CAC_OVFF		34
#define VECT_GPT_ETGIN          40
#define VECT_GPT_ETGIP          41
#define	VECT_RSPI0_SPEI0	44
#define	VECT_RSPI0_SPRI0	45
#define	VECT_RSPI0_SPTI0	46
#define	VECT_RSPI0_SPII0	47
#define VECT_GPT0_GTCIA0        48
#define VECT_GPT0_GTCIB0        49
#define VECT_GPT0_GTCIC0        50
#define VECT_GPT0_GTCID0        51
#define VECT_GPT0_GDTE0         52
#define VECT_GPT0_GTCIE0        53
#define VECT_GPT0_GTCIF0        54
#define VECT_GPT0_GTCIV0        55
#define VECT_GPT0_GTCIU0        56
#define	VECT_DOC_DOPCF		57
#define	VECT_RSCAN_COMFRXINT	59
#define	VECT_RSCAN_RXFINT	60
#define	VECT_RSCAN_TXINT	61
#define	VECT_RSCAN_CHERRINT	62
#define	VECT_RSCAN_GLERRINT	63
#define	VECT_ICU_IRQ0		64
#define	VECT_ICU_IRQ1		65
#define	VECT_ICU_IRQ2		66
#define	VECT_ICU_IRQ3		67
#define	VECT_ICU_IRQ4		68
#define	VECT_ICU_IRQ5		69
#define	VECT_ICU_IRQ6		70
#define	VECT_ICU_IRQ7		71
#define	VECT_LVD_LVD1		88
#define	VECT_LVD_LVD2		89
#define VECT_GPT1_GTCIA1        98
#define VECT_GPT1_GTCIB1        99
#define VECT_GPT1_GTCIC1        100
#define VECT_GPT1_GTCID1        101
#define	VECT_S12AD_S12ADI	102
#define	VECT_S12AD_GBADI	103
#define	VECT_S12AD_GCADI	104
#define	VECT_S12AD1_S12ADI1	105
#define	VECT_S12AD1_GBADI1	106
#define	VECT_S12AD1_GCADI1	107
#define	VECT_CMPC0_CMPC0	108
#define	VECT_CMPC1_CMPC1	109
#define	VECT_CMPC2_CMPC2	110
#define	VECT_S12AD2_S12ADI2	111
#define	VECT_S12AD2_GBADI2	112
#define	VECT_S12AD2_GCADI2	113
#define	VECT_MTU0_TGIA0		114
#define	VECT_MTU0_TGIB0		115
#define	VECT_MTU0_TGIC0		116
#define	VECT_MTU0_TGID0		117
#define	VECT_MTU0_TCIV0		118
#define	VECT_MTU0_TGIE0		119
#define	VECT_MTU0_TGIF0		120
#define	VECT_MTU1_TGIA1		121
#define	VECT_MTU1_TGIB1		122
#define	VECT_MTU1_TCIV1		123
#define	VECT_MTU1_TCIU1		124
#define	VECT_MTU2_TGIA2		125
#define	VECT_MTU2_TGIB2		126
#define	VECT_MTU2_TCIV2		127
#define	VECT_MTU2_TCIU2		128
#define	VECT_MTU3_TGIA3		129
#define	VECT_MTU3_TGIB3		130
#define	VECT_MTU3_TGIC3		131
#define	VECT_MTU3_TGID3		132
#define	VECT_MTU3_TCIV3		133
#define	VECT_MTU4_TGIA4		134
#define	VECT_MTU4_TGIB4		135
#define	VECT_MTU4_TGIC4		136
#define	VECT_MTU4_TGID4		137
#define	VECT_MTU4_TCIV4		138
#define	VECT_MTU5_TGIU5		139
#define	VECT_MTU5_TGIV5		140
#define	VECT_MTU5_TGIW5		141
#define	VECT_MTU6_TGIA6		142
#define	VECT_MTU6_TGIB6		143
#define	VECT_MTU6_TGIC6		144
#define	VECT_MTU6_TGID6		145
#define	VECT_MTU6_TCIV6		146
#define	VECT_MTU7_TGIA7		149
#define	VECT_MTU7_TGIB7		150
#define	VECT_MTU7_TGIC7		151
#define	VECT_MTU7_TGID7		152
#define	VECT_MTU7_TCIV7		153
#define	VECT_MTU9_TGIA9		159
#define	VECT_MTU9_TGIB9		160
#define	VECT_MTU9_TGIC9		161
#define	VECT_MTU9_TGID9		162
#define	VECT_MTU9_TCIV9		163
#define	VECT_MTU9_TGIE9		164
#define	VECT_MTU9_TGIF9		165
#define	VECT_POE_OEI1		168
#define	VECT_POE_OEI2		169
#define	VECT_POE_OEI3		170
#define	VECT_POE_OEI4		171
#define	VECT_POE_OEI5		172
#define	VECT_CMPC3_CMPC3	173
#define	VECT_TMR0_CMIA0		174
#define	VECT_TMR0_CMIB0		175
#define	VECT_TMR0_OVI0		176
#define	VECT_TMR1_CMIA1		177
#define	VECT_TMR1_CMIB1		178
#define	VECT_TMR1_OVI1		179
#define	VECT_TMR2_CMIA2		180
#define	VECT_TMR2_CMIB2		181
#define	VECT_TMR2_OVI2		182
#define	VECT_TMR3_CMIA3		183
#define	VECT_TMR3_CMIB3		184
#define	VECT_TMR3_OVI3		185
#define	VECT_TMR4_CMIA4		186
#define	VECT_TMR4_CMIB4		187
#define	VECT_TMR4_OVI4		188
#define	VECT_TMR5_CMIA5		189
#define	VECT_TMR5_CMIB5		190
#define	VECT_TMR5_OVI5		191
#define	VECT_TMR6_CMIA6		192
#define	VECT_TMR6_CMIB6		193
#define	VECT_TMR6_OVI6		194
#define	VECT_TMR7_CMIA7		195
#define	VECT_TMR7_CMIB7		196
#define	VECT_TMR7_OVI7		197
#define VECT_GPT1_GDTE1         202
#define VECT_GPT1_GTCIE1        203
#define VECT_GPT1_GTCIF1        204
#define VECT_GPT1_GTCIV1        205
#define VECT_GPT1_GTCIU1        206
#define VECT_GPT2_GTCIA2        207
#define VECT_GPT2_GTCIB2        208
#define VECT_GPT2_GTCIC2        209
#define VECT_GPT2_GTCID2        210
#define VECT_GPT2_GDTE2         211
#define VECT_GPT2_GTCIE2        212
#define VECT_GPT2_GTCIF2        213
#define VECT_GPT2_GTCIV2        214
#define VECT_GPT2_GTCIU2        215
#define VECT_GPT3_GTCIA3        216
#define VECT_GPT3_GTCIB3        217
#define	VECT_SCI1_ERI1		218
#define	VECT_SCI1_RXI1		219
#define	VECT_SCI1_TXI1		220
#define	VECT_SCI1_TEI1		221
#define	VECT_SCI5_ERI5		222
#define	VECT_SCI5_RXI5		223
#define	VECT_SCI5_TXI5		224
#define	VECT_SCI5_TEI5		225
#define	VECT_SCI6_ERI6		226
#define	VECT_SCI6_RXI6		227
#define	VECT_SCI6_TXI6		228
#define	VECT_SCI6_TEI6		229
#define VECT_SCI8_ERI8          230
#define VECT_SCI8_RXI8          231
#define VECT_SCI8_TXI8          232
#define VECT_SCI8_TEI8          233
#define VECT_SCI9_ERI9          234
#define VECT_SCI9_RXI9          235
#define VECT_SCI9_TXI9          236
#define VECT_SCI9_TEI9          237
#define VECT_GPT3_GTCIC3        238
#define VECT_GPT3_GTCID3        239
#define VECT_GPT3_GDTE3         240
#define VECT_GPT3_GTCIE3        241
#define VECT_GPT3_GTCIF3        242
#define VECT_GPT3_GTCIV3        243
#define VECT_GPT3_GTCIU3        244
#define	VECT_RIIC0_EEI0		246
#define	VECT_RIIC0_RXI0		247
#define	VECT_RIIC0_TXI0		248
#define	VECT_RIIC0_TEI0		249
#define VECT_SCI11_ERI11        250
#define VECT_SCI11_RXI11        251
#define VECT_SCI11_TXI11        252
#define VECT_SCI11_TEI11        253

#define	MSTP_DTC	SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_S12AD2	SYSTEM.MSTPCRA.BIT.MSTPA23
#define	MSTP_DA		SYSTEM.MSTPCRA.BIT.MSTPA19
#define	MSTP_S12AD	SYSTEM.MSTPCRA.BIT.MSTPA17
#define	MSTP_S12AD1	SYSTEM.MSTPCRA.BIT.MSTPA16
#define	MSTP_CMT0	SYSTEM.MSTPCRA.BIT.MSTPA15
#define	MSTP_CMT1	SYSTEM.MSTPCRA.BIT.MSTPA15
#define	MSTP_CMT2	SYSTEM.MSTPCRA.BIT.MSTPA14
#define	MSTP_CMT3	SYSTEM.MSTPCRA.BIT.MSTPA14
#define	MSTP_MTU	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU0	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU1	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU2	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU3	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU4	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU5	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU6	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU7	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU9	SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_GPT	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPT0	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPT1	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPT2	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPT3	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPT01	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPT23	SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_TMR0	SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR1	SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR01	SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR2	SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_TMR3	SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_TMR23	SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_TMR4	SYSTEM.MSTPCRA.BIT.MSTPA3
#define	MSTP_TMR5	SYSTEM.MSTPCRA.BIT.MSTPA3
#define	MSTP_TMR45	SYSTEM.MSTPCRA.BIT.MSTPA3
#define	MSTP_TMR6	SYSTEM.MSTPCRA.BIT.MSTPA2
#define	MSTP_TMR7	SYSTEM.MSTPCRA.BIT.MSTPA2
#define	MSTP_TMR67	SYSTEM.MSTPCRA.BIT.MSTPA2
#define	MSTP_SCI1	SYSTEM.MSTPCRB.BIT.MSTPB30
#define	MSTP_SMCI1	SYSTEM.MSTPCRB.BIT.MSTPB30
#define	MSTP_SCI5	SYSTEM.MSTPCRB.BIT.MSTPB26
#define	MSTP_SMCI5	SYSTEM.MSTPCRB.BIT.MSTPB26
#define	MSTP_SCI6	SYSTEM.MSTPCRB.BIT.MSTPB25
#define	MSTP_SMCI6	SYSTEM.MSTPCRB.BIT.MSTPB25
#define	MSTP_CRC	SYSTEM.MSTPCRB.BIT.MSTPB23
#define	MSTP_RIIC0	SYSTEM.MSTPCRB.BIT.MSTPB21
#define	MSTP_RSPI0	SYSTEM.MSTPCRB.BIT.MSTPB17
#define	MSTP_CMPC0	SYSTEM.MSTPCRB.BIT.MSTPB10
#define	MSTP_CMPC1	SYSTEM.MSTPCRB.BIT.MSTPB10
#define	MSTP_CMPC2	SYSTEM.MSTPCRB.BIT.MSTPB10
#define	MSTP_CMPC3	SYSTEM.MSTPCRB.BIT.MSTPB10
#define	MSTP_DOC	SYSTEM.MSTPCRB.BIT.MSTPB6
#define	MSTP_RSCAN	SYSTEM.MSTPCRB.BIT.MSTPB0
#define	MSTP_RSCAN0	SYSTEM.MSTPCRB.BIT.MSTPB0
#define	MSTP_SCI8	SYSTEM.MSTPCRC.BIT.MSTPC27
#define	MSTP_SMCI8	SYSTEM.MSTPCRC.BIT.MSTPC27
#define	MSTP_SCI9	SYSTEM.MSTPCRC.BIT.MSTPC26
#define	MSTP_SMCI9	SYSTEM.MSTPCRC.BIT.MSTPC26
#define	MSTP_SCI11	SYSTEM.MSTPCRC.BIT.MSTPC24
#define	MSTP_SMCI11	SYSTEM.MSTPCRC.BIT.MSTPC24
#define	MSTP_CAC	SYSTEM.MSTPCRC.BIT.MSTPC19
#define	MSTP_RAM0	SYSTEM.MSTPCRC.BIT.MSTPC0

